app/controllers/api/v1/posts_controller.rb

      def index
        @posts = policy_scope(Post)
        @posts = Post.where(nil)
        @posts = @posts.filter_by_title(params[:title]) if params[:title].present?
         @posts = @posts.filter_by_category(params[:category]) if params[:category].present?
---
SELECT "posts".* FROM "posts" WHERE "posts"."title" = $1  [["title", "Blockchain is good?"]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", nil]]
SELECT 1 AS one FROM "posts" WHERE "posts"."title" = $1 AND "posts"."id" != $2 LIMIT $3  [["title", ""], ["id", 4], ["LIMIT", 1]]

      def create
        @post = Post.new(post_params)
        @post.user = current_user
        authorize @post
        if @post.save
---
INSERT INTO "posts" ("title", "content", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"